discokittyimplementation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-24 Mon 17:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Discokitty, an implementation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="blog.html">Mario Román</a>
</div>
<div id="navigation">
<a href="about.html">About</a>
<a href="blog.html">Blog</a>
<a href="math.html">Math</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Discokitty, an implementation</h1>
<p>
As a part of the course on Distributional Models of Meaning by <a href="https://www.cs.ox.ac.uk/people/bob.coecke/">Coecke</a>
and <a href="https://www.cs.ox.ac.uk/people/dan.marsden/">Marsden</a>, I wrote an educational implementation of the DisCoCat
framework (as described in 
<i>"<a href="https://arxiv.org/abs/1003.4394">Mathematical Foundations for a Compositional Distributional Model of Meaning</a>"</i>).
</p>

<p>
<b>Discokitty</b> is written on Haskell and the code can be found <a href="https://github.com/mroman42/discokitty">on GitHub</a>.
</p>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 24th June, 2019. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
